In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import statsmodels.formula.api as smf
from numpy import random

from plotnine import *
%matplotlib inline

In [44]:
df = pd.read_excel('Census_data.xlsx')

df= df.rename(columns={'standard_occupational_classification': 'SOC'})

df.head()

,children_in_household,weekly_hours_worked,age,household_income,birth_area,marital_status,sex,education,SOC,PUMA,ST
0,0,18,24,11000,7,5,2,22,434171,3810,36
1,0,35,59,96000,5,5,2,18,436011,3810,36
2,0,0,69,19200,1,5,1,18,N,3810,36
3,0,40,63,100000,5,1,1,16,119141,3810,36
4,0,0,63,100000,5,1,2,16,N,3810,36

In [47]:
for i in range(len(df['SOC'])): 
    instance = df['SOC'][i]
    if(instance == 'N'):
        df['SOC'][i] = 0
    else:
        df['SOC'][i] = int(str(df['SOC'][i])[0:2])

df.head()

/var/folders/3h/kq2037cj49l2x34nyyjnxv1h0000gn/T/ipykernel_22238/1604873599.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

,children_in_household,weekly_hours_worked,age,household_income,birth_area,marital_status,sex,education,SOC,PUMA,ST
0,0,18,24,11000,7,5,2,22,43,3810,36
1,0,35,59,96000,5,5,2,18,43,3810,36
2,0,0,69,19200,1,5,1,18,0,3810,36
3,0,40,63,100000,5,1,1,16,11,3810,36
4,0,0,63,100000,5,1,2,16,0,3810,36